; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	image5 - mode
	infrared0 - mode
	spectrograph3 - mode
	thermograph4 - mode
	infrared2 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star5 - direction
	Star1 - direction
	Star4 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 Star3)
	(calibration_target instrument0 Star4)
	(supports instrument1 image5)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 spectrograph3)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star5)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star4)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite0 Star9)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon6 image5)
	(have_image Planet7 thermograph4)
	(have_image Phenomenon8 infrared2)
	(have_image Phenomenon8 thermograph1)
	(have_image Star9 thermograph1)
	(have_image Planet10 thermograph4)
	(have_image Star11 infrared0)
	(have_image Star12 spectrograph3)
	(have_image Star13 spectrograph3)
	(have_image Star13 infrared0)
	(have_image Star14 thermograph1)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 13
2. (calibrate satellite1 instrument2 star5)
   added: (calibrated instrument2)
   goals met: 0 of 13
3. (turn_to satellite1 star13 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star13)
   goals met: 0 of 13
4. (take_image satellite1 star13 instrument2 spectrograph3)
   added: (have_image star13 spectrograph3)
   goals met: 1 of 13
5. (take_image satellite1 star13 instrument2 infrared0)
   added: (have_image star13 infrared0)
   goals met: 2 of 13
6. (turn_to satellite1 star11 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star11)
   goals met: 2 of 13
7. (take_image satellite1 star11 instrument2 infrared0)
   added: (have_image star11 infrared0)
   goals met: 3 of 13
8. (turn_to satellite1 phenomenon8 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon8)
   goals met: 3 of 13
9. (turn_to satellite0 star4 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star4)
   goals met: 3 of 13
10. (take_image satellite1 phenomenon8 instrument2 thermograph1)
   added: (have_image phenomenon8 thermograph1)
   goals met: 4 of 13
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 13
12. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 4 of 13
13. (turn_to satellite0 phenomenon6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 13
14. (take_image satellite0 phenomenon6 instrument1 image5)
   added: (have_image phenomenon6 image5)
   goals met: 5 of 13
15. (turn_to satellite0 star9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star9)
   goals met: 6 of 13
16. (turn_to satellite1 star12 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 star12)
   goals met: 6 of 13
17. (take_image satellite1 star12 instrument2 spectrograph3)
   added: (have_image star12 spectrograph3)
   goals met: 7 of 13
18. (turn_to satellite1 star14 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star14)
   goals met: 7 of 13
19. (take_image satellite1 star14 instrument2 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 8 of 13
20. (turn_to satellite1 star9 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star9)
   goals met: 8 of 13
21. (take_image satellite1 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 9 of 13
22. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 9 of 13
23. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 9 of 13
24. (turn_to satellite1 star4 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 star4)
   goals met: 9 of 13
25. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 9 of 13
26. (turn_to satellite1 phenomenon6 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon6)
   goals met: 9 of 13
27. (take_image satellite1 phenomenon6 instrument4 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 10 of 13
28. (turn_to satellite1 phenomenon8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon8)
   goals met: 10 of 13
29. (take_image satellite1 phenomenon8 instrument4 infrared2)
   added: (have_image phenomenon8 infrared2)
   goals met: 11 of 13
30. (turn_to satellite1 planet10 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet10)
   goals met: 11 of 13
31. (take_image satellite1 planet10 instrument4 thermograph4)
   added: (have_image planet10 thermograph4)
   goals met: 12 of 13
32. (turn_to satellite1 planet7 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet7)
   goals met: 12 of 13
33. (take_image satellite1 planet7 instrument4 thermograph4)
   added: (have_image planet7 thermograph4)
   goals met: 13 of 13
